/* ------------------------------------------------------------ *
File mode_BluetoothSetting.h

Bluetoothモジュールのボーレート等を設定する.
* ------------------------------------------------------------ */
#ifndef MODE_BLUETOOTHSETTING_H
#define MODE_BLUETOOTHSETTING_H

void mode_BluetoothSetting(void);

#endif

/******************************************************************************
**                            End Of File
******************************************************************************/
